Revit 2027 API
ExportLinetypeKey(ExportLinetypeKey) Constructor
 Constructs a new copy of the input ExportLinetypeKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeKey(
	ExportLinetypeKey other
)
Public Sub New (
	other As ExportLinetypeKey
)
public:
ExportLinetypeKey(
	ExportLinetypeKey^ other
)
new :
        other : ExportLinetypeKey -> ExportLinetypeKey
Parameters
other ExportLinetypeKey
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeKey Class
ExportLinetypeKey Overload
Autodesk.Revit.DB Namespace